# __Handling Missing Data__

In [1]:
import pandas as pd
import numpy as  np

In [20]:
df=pd.read_csv('D:\\MyEnvironment\\Jupyter-Notebook\\Notebooks\\Dataset\\Data.csv')
df

    EmpID    Name       Dept   Age   Salary  Experience
0   101.0     Ali         IT  22.0  45000.0         1.0
1   102.0    Sara         HR  29.0  52000.0         5.0
2   103.0   Ahmed         IT  24.0  48000.0         2.0
3   104.0    Zara    Finance  31.0  60000.0         7.0
4   105.0   Usman         HR  26.0  50000.0         3.0
5   106.0    Hina         IT  23.0  47000.0         1.0
6   107.0   Bilal         HR  28.0  55000.0         4.0
7   108.0    Nida         it  30.0  62000.0         6.0
8   109.0     NaN    Finance   NaN  58000.0         8.0
9   110.0    Omer  Marketing  25.0      NaN         2.0
10  101.0     Ali         IT  22.0  45000.0         1.0
11  112.0   Tariq      Sales  45.0  70000.0        15.0
12  113.0  Haroon         IT  21.0  55000.0         NaN
13    NaN     NaN        NaN   NaN      NaN         NaN
14  114.0  Shahid         HR  22.0  55000.0         1.0

---
## DropNA
    dropna(): Drops Rows that contains NaN Values
    dropna(axis=1) : Drops Columns that contains NaN Values

In [3]:
df.dropna()

    EmpID    Name     Dept   Age   Salary  Experience
0   101.0     Ali       IT  22.0  45000.0         1.0
1   102.0    Sara       HR  29.0  52000.0         5.0
2   103.0   Ahmed       IT  24.0  48000.0         2.0
3   104.0    Zara  Finance  31.0  60000.0         7.0
4   105.0   Usman       HR  26.0  50000.0         3.0
5   106.0    Hina       IT  23.0  47000.0         1.0
6   107.0   Bilal       HR  28.0  55000.0         4.0
7   108.0    Nida       it  30.0  62000.0         6.0
10  101.0     Ali       IT  22.0  45000.0         1.0
11  112.0   Tariq    Sales  45.0  70000.0        15.0
14  114.0  Shahid       HR  22.0  55000.0         1.0

In [4]:
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14]

##### __how= Parameter using to check if row contains NaN__
    "any" : checks if row contains ANY NaN
    "all" : checks if row is full of NaN

In [5]:
df.dropna(how="any")

    EmpID    Name     Dept   Age   Salary  Experience
0   101.0     Ali       IT  22.0  45000.0         1.0
1   102.0    Sara       HR  29.0  52000.0         5.0
2   103.0   Ahmed       IT  24.0  48000.0         2.0
3   104.0    Zara  Finance  31.0  60000.0         7.0
4   105.0   Usman       HR  26.0  50000.0         3.0
5   106.0    Hina       IT  23.0  47000.0         1.0
6   107.0   Bilal       HR  28.0  55000.0         4.0
7   108.0    Nida       it  30.0  62000.0         6.0
10  101.0     Ali       IT  22.0  45000.0         1.0
11  112.0   Tariq    Sales  45.0  70000.0        15.0
14  114.0  Shahid       HR  22.0  55000.0         1.0

In [6]:
df.dropna(how="all")

    EmpID    Name       Dept   Age   Salary  Experience
0   101.0     Ali         IT  22.0  45000.0         1.0
1   102.0    Sara         HR  29.0  52000.0         5.0
2   103.0   Ahmed         IT  24.0  48000.0         2.0
3   104.0    Zara    Finance  31.0  60000.0         7.0
4   105.0   Usman         HR  26.0  50000.0         3.0
5   106.0    Hina         IT  23.0  47000.0         1.0
6   107.0   Bilal         HR  28.0  55000.0         4.0
7   108.0    Nida         it  30.0  62000.0         6.0
8   109.0     NaN    Finance   NaN  58000.0         8.0
9   110.0    Omer  Marketing  25.0      NaN         2.0
10  101.0     Ali         IT  22.0  45000.0         1.0
11  112.0   Tariq      Sales  45.0  70000.0        15.0
12  113.0  Haroon         IT  21.0  55000.0         NaN
14  114.0  Shahid         HR  22.0  55000.0         1.0

##### __subset=["ColName"] : removes NaN from Particular columns__

In [7]:
df.dropna(subset=['Age'])

    EmpID    Name       Dept   Age   Salary  Experience
0   101.0     Ali         IT  22.0  45000.0         1.0
1   102.0    Sara         HR  29.0  52000.0         5.0
2   103.0   Ahmed         IT  24.0  48000.0         2.0
3   104.0    Zara    Finance  31.0  60000.0         7.0
4   105.0   Usman         HR  26.0  50000.0         3.0
5   106.0    Hina         IT  23.0  47000.0         1.0
6   107.0   Bilal         HR  28.0  55000.0         4.0
7   108.0    Nida         it  30.0  62000.0         6.0
9   110.0    Omer  Marketing  25.0      NaN         2.0
10  101.0     Ali         IT  22.0  45000.0         1.0
11  112.0   Tariq      Sales  45.0  70000.0        15.0
12  113.0  Haroon         IT  21.0  55000.0         NaN
14  114.0  Shahid         HR  22.0  55000.0         1.0

##### __inplace=True : save changes into Original DataFrame__

In [8]:
df.dropna(inplace=True)
df

    EmpID    Name     Dept   Age   Salary  Experience
0   101.0     Ali       IT  22.0  45000.0         1.0
1   102.0    Sara       HR  29.0  52000.0         5.0
2   103.0   Ahmed       IT  24.0  48000.0         2.0
3   104.0    Zara  Finance  31.0  60000.0         7.0
4   105.0   Usman       HR  26.0  50000.0         3.0
5   106.0    Hina       IT  23.0  47000.0         1.0
6   107.0   Bilal       HR  28.0  55000.0         4.0
7   108.0    Nida       it  30.0  62000.0         6.0
10  101.0     Ali       IT  22.0  45000.0         1.0
11  112.0   Tariq    Sales  45.0  70000.0        15.0
14  114.0  Shahid       HR  22.0  55000.0         1.0

In [9]:
df

    EmpID    Name     Dept   Age   Salary  Experience
0   101.0     Ali       IT  22.0  45000.0         1.0
1   102.0    Sara       HR  29.0  52000.0         5.0
2   103.0   Ahmed       IT  24.0  48000.0         2.0
3   104.0    Zara  Finance  31.0  60000.0         7.0
4   105.0   Usman       HR  26.0  50000.0         3.0
5   106.0    Hina       IT  23.0  47000.0         1.0
6   107.0   Bilal       HR  28.0  55000.0         4.0
7   108.0    Nida       it  30.0  62000.0         6.0
10  101.0     Ali       IT  22.0  45000.0         1.0
11  112.0   Tariq    Sales  45.0  70000.0        15.0
14  114.0  Shahid       HR  22.0  55000.0         1.0

##### __thresh= n : removes rows containing n number or NaN__

In [10]:
df.dropna(thresh=1)

    EmpID    Name     Dept   Age   Salary  Experience
0   101.0     Ali       IT  22.0  45000.0         1.0
1   102.0    Sara       HR  29.0  52000.0         5.0
2   103.0   Ahmed       IT  24.0  48000.0         2.0
3   104.0    Zara  Finance  31.0  60000.0         7.0
4   105.0   Usman       HR  26.0  50000.0         3.0
5   106.0    Hina       IT  23.0  47000.0         1.0
6   107.0   Bilal       HR  28.0  55000.0         4.0
7   108.0    Nida       it  30.0  62000.0         6.0
10  101.0     Ali       IT  22.0  45000.0         1.0
11  112.0   Tariq    Sales  45.0  70000.0        15.0
14  114.0  Shahid       HR  22.0  55000.0         1.0

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 11 entries, 0 to 14
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   EmpID       11 non-null     float64
 1   Name        11 non-null     object
 2   Dept        11 non-null     object
 3   Age         11 non-null     float64
 4   Salary      11 non-null     float64
 5   Experience  11 non-null     float64
dtypes: float64(4), object(2)
memory usage: 616.0+ bytes

----
## FillNa

In [12]:
df

    EmpID    Name     Dept   Age   Salary  Experience
0   101.0     Ali       IT  22.0  45000.0         1.0
1   102.0    Sara       HR  29.0  52000.0         5.0
2   103.0   Ahmed       IT  24.0  48000.0         2.0
3   104.0    Zara  Finance  31.0  60000.0         7.0
4   105.0   Usman       HR  26.0  50000.0         3.0
5   106.0    Hina       IT  23.0  47000.0         1.0
6   107.0   Bilal       HR  28.0  55000.0         4.0
7   108.0    Nida       it  30.0  62000.0         6.0
10  101.0     Ali       IT  22.0  45000.0         1.0
11  112.0   Tariq    Sales  45.0  70000.0        15.0
14  114.0  Shahid       HR  22.0  55000.0         1.0

### fillna(data) : to fill NaN values with given data.
    fillna({ 'ColName': Data }) : to fill data in particular column

In [13]:
df.fillna('python')

    EmpID    Name     Dept   Age   Salary  Experience
0   101.0     Ali       IT  22.0  45000.0         1.0
1   102.0    Sara       HR  29.0  52000.0         5.0
2   103.0   Ahmed       IT  24.0  48000.0         2.0
3   104.0    Zara  Finance  31.0  60000.0         7.0
4   105.0   Usman       HR  26.0  50000.0         3.0
5   106.0    Hina       IT  23.0  47000.0         1.0
6   107.0   Bilal       HR  28.0  55000.0         4.0
7   108.0    Nida       it  30.0  62000.0         6.0
10  101.0     Ali       IT  22.0  45000.0         1.0
11  112.0   Tariq    Sales  45.0  70000.0        15.0
14  114.0  Shahid       HR  22.0  55000.0         1.0

In [14]:
df.fillna({"Age":0,"Experience":0})

    EmpID    Name     Dept   Age   Salary  Experience
0   101.0     Ali       IT  22.0  45000.0         1.0
1   102.0    Sara       HR  29.0  52000.0         5.0
2   103.0   Ahmed       IT  24.0  48000.0         2.0
3   104.0    Zara  Finance  31.0  60000.0         7.0
4   105.0   Usman       HR  26.0  50000.0         3.0
5   106.0    Hina       IT  23.0  47000.0         1.0
6   107.0   Bilal       HR  28.0  55000.0         4.0
7   108.0    Nida       it  30.0  62000.0         6.0
10  101.0     Ali       IT  22.0  45000.0         1.0
11  112.0   Tariq    Sales  45.0  70000.0        15.0
14  114.0  Shahid       HR  22.0  55000.0         1.0

### Method Parameter: Used to fill data of last row or next row
    method="ffill" : For Forward Filling (fill data same as previous row)
    method="bfill" : For Backward Filling (fill data same as next row)

#### __obj.ffill() & obj.bfill__ can also be used instead.

In [15]:
# df.fillna(method="ffill")
df.ffill()

    EmpID    Name     Dept   Age   Salary  Experience
0   101.0     Ali       IT  22.0  45000.0         1.0
1   102.0    Sara       HR  29.0  52000.0         5.0
2   103.0   Ahmed       IT  24.0  48000.0         2.0
3   104.0    Zara  Finance  31.0  60000.0         7.0
4   105.0   Usman       HR  26.0  50000.0         3.0
5   106.0    Hina       IT  23.0  47000.0         1.0
6   107.0   Bilal       HR  28.0  55000.0         4.0
7   108.0    Nida       it  30.0  62000.0         6.0
10  101.0     Ali       IT  22.0  45000.0         1.0
11  112.0   Tariq    Sales  45.0  70000.0        15.0
14  114.0  Shahid       HR  22.0  55000.0         1.0

In [16]:
# df.fillna(method="bfill")
df.bfill()

    EmpID    Name     Dept   Age   Salary  Experience
0   101.0     Ali       IT  22.0  45000.0         1.0
1   102.0    Sara       HR  29.0  52000.0         5.0
2   103.0   Ahmed       IT  24.0  48000.0         2.0
3   104.0    Zara  Finance  31.0  60000.0         7.0
4   105.0   Usman       HR  26.0  50000.0         3.0
5   106.0    Hina       IT  23.0  47000.0         1.0
6   107.0   Bilal       HR  28.0  55000.0         4.0
7   108.0    Nida       it  30.0  62000.0         6.0
10  101.0     Ali       IT  22.0  45000.0         1.0
11  112.0   Tariq    Sales  45.0  70000.0        15.0
14  114.0  Shahid       HR  22.0  55000.0         1.0

In [17]:
df

    EmpID    Name     Dept   Age   Salary  Experience
0   101.0     Ali       IT  22.0  45000.0         1.0
1   102.0    Sara       HR  29.0  52000.0         5.0
2   103.0   Ahmed       IT  24.0  48000.0         2.0
3   104.0    Zara  Finance  31.0  60000.0         7.0
4   105.0   Usman       HR  26.0  50000.0         3.0
5   106.0    Hina       IT  23.0  47000.0         1.0
6   107.0   Bilal       HR  28.0  55000.0         4.0
7   108.0    Nida       it  30.0  62000.0         6.0
10  101.0     Ali       IT  22.0  45000.0         1.0
11  112.0   Tariq    Sales  45.0  70000.0        15.0
14  114.0  Shahid       HR  22.0  55000.0         1.0

### __axis=1 : for filling data of Columns__

In [18]:
# f-fill
# df.fillna(method='ffill',axis=1)
# df.ffill(axis=1)

#b-fill
# df.fillna(method='bfill',axis=1)
# df.bfill(axis=1)

### Limit Parameter
    limit = n : fill data into column upto n limit

In [28]:
df.fillna('python',limit=1)

     EmpID    Name       Dept     Age   Salary Experience
0    101.0     Ali         IT    22.0  45000.0        1.0
1    102.0    Sara         HR    29.0  52000.0        5.0
2    103.0   Ahmed         IT    24.0  48000.0        2.0
3    104.0    Zara    Finance    31.0  60000.0        7.0
4    105.0   Usman         HR    26.0  50000.0        3.0
5    106.0    Hina         IT    23.0  47000.0        1.0
6    107.0   Bilal         HR    28.0  55000.0        4.0
7    108.0    Nida         it    30.0  62000.0        6.0
8    109.0  python    Finance  python  58000.0        8.0
9    110.0    Omer  Marketing    25.0   python        2.0
10   101.0     Ali         IT    22.0  45000.0        1.0
11   112.0   Tariq      Sales    45.0  70000.0       15.0
12   113.0  Haroon         IT    21.0  55000.0     python
13  python     NaN     python     NaN      NaN        NaN
14   114.0  Shahid         HR    22.0  55000.0        1.0